Tekla Open API Reference for Tekla Structures 2025
TemporaryTransparency Enumeration
 The possible temporary transparencies. Used to temporarily change transparency of a model object to visualize some state in the model.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum TemporaryTransparency
Public Enumeration TemporaryTransparency
Members
Member name | Value | Description
HIDDEN | 0 |  Object is hidden.
TRANSPARENT | 1 |  Object is transparent.
SEMITRANSPARENT | 3 |  Object is semi transparent.
SEMIVISIBLE | 5 |  Object is almost fully visible.
VISIBLE | 10 |  Object is fully visible.
See Also
Reference
Tekla.Structures.Model.UI Namespace